In [19]:
import pandas as pd
import numpy as np

In [3]:
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
    
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
  
display(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Grouping data with one key: 
In order to group data with one key, we pass only one key as an argument in groupby function.

In [8]:
#using groupby function
# with one key
 
gk=df.groupby('Name')
print(df.groupby('Qualification').groups)

# Let's print the first entries 
# in all the groups formed. 
gk.first()

{'B.Tech': [4], 'B.com': [5], 'MA': [1, 7], 'MCA': [2], 'Msc': [0, 6], 'Phd': [3]}

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

Grouping data with multiple keys : 
In order to group data with multiple keys, we pass multiple keys in groupby function.

In [9]:
df.groupby(['Name', 'Qualification'])
 
print(df.groupby(['Name', 'Qualification']).groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [23]:
df[['Name','Age']].groupby("Name",sort=False).sum()  # all the values wiill be summed 
# group by automatically sorts it by name so set it to false

        Age
Name
Jai      49
Anuj     60
Princi   59
Gaurav   33
Abhi     32

In [17]:
grp = df.groupby('Name')
for name,group in grp:
    print(name)
    print(group)

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA
Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com
Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech
Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA
Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [18]:
# selecting a single group
 
grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [ ]:
grp = df.groupby(['Name', 'Qualification'])
grp.get_group(('Jai', 'Msc'))

APPLUING A FUNCTION TO GROUP
Aggregation is a process in which we compute a summary statistic about each group. Aggregated function returns a single aggregated value for each group. After splitting a data into groups using groupby function, several aggregation operations can be performed on the grouped data. 
sum(),mean(),median(),first(),last(),count(),max(),min(),std(),var()

In [20]:
# performing aggregation on
# group containing multiple
# keys
grp1 = df.groupby(['Name', 'Qualification'])
 
grp1.aggregate(np.sum)  # we can use sun directly

C:\Users\HP\AppData\Local\Temp\ipykernel_3500\963661681.py:6: FutureWarning: The provided callable <function sum at 0x00000216D6F956C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp1.aggregate(np.sum)

                      Age    Address
Name   Qualification
Abhi   MA              32    Aligarh
Anuj   B.com           36     Kanpur
       MA              24     Kanpur
Gaurav B.Tech          33    Jaunpur
Jai    MCA             22  Allahabad
       Msc             27     Nagpur
Princi Msc             27  Allahabad
       Phd             32    Kannuaj

In [25]:
result = df[['Name','Age']].groupby('Name', sort=False).agg(['mean', 'max', 'min'])
print("\nAggregate with Multiple Functions (mean, max, min):")
print(result)

Aggregate with Multiple Functions (mean, max, min):
         Age
        mean max min
Name
Jai     24.5  27  22
Anuj    30.0  36  24
Princi  29.5  32  27
Gaurav  33.0  33  33
Abhi    32.0  32  32

Applying different functions to DataFrame columns : 
In order to apply a different aggregation to the columns of a DataFrame, we can pass a dictionary to aggregate .

In [26]:
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA'],
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
    
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
  
print(df) 
grp = df.groupby('Name')
 
grp.agg({'Age' : 'sum', 'Score' : 'std'})

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

        Age      Score
Name
Abhi     32        NaN
Anuj     60  11.313708
Gaurav   33        NaN
Jai      49   8.485281
Princi   59   4.949747